Problem 3

Create a Pandas DataFrame with 10 rows representing student records, with columns
Name, Subject, Score (random integers between 50 and 100), and Grade (initially empty):

In [1]:
import pandas as pd
import random 

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Helen', 'Ian', 'Jack'],
    'Subject': ['Math', 'Science', 'English', 'Math', 'Science', 'English', 'Math', 'Science', 'English', 'Math'],
    'Score': [random.randint(50,100) for _ in range(10)],
    'Grade': ['']*10,
})
df

      Name  Subject  Score Grade
0    Alice     Math     54
1      Bob  Science     61
2  Charlie  English     88
3    David     Math     68
4      Eva  Science     53
5    Frank  English     90
6    Grace     Math     65
7    Helen  Science     57
8      Ian  English     96
9     Jack     Math     72

(a) Assign grades based on scores: A (90–100), B (80–89), C (70–79), D (60–69), F
(below 60):

In [2]:
for i in range(10):
    if df.loc[i, 'Score'] in range(90,101):
        df.loc[i, 'Grade'] = 'A'
    elif df.loc[i, 'Score'] in range(80,90):
        df.loc[i, 'Grade'] = 'B'
    elif df.loc[i, 'Score'] in range(70,80):
        df.loc[i, 'Grade'] = 'C'
    elif df.loc[i, 'Score'] in range(60,70):
        df.loc[i, 'Grade'] = 'D'
    else:
        df.loc[i, 'Grade'] = 'F'

df['Grade']

0    F
1    D
2    B
3    D
4    F
5    A
6    D
7    F
8    A
9    C
Name: Grade, dtype: object

(b) Print the DataFrame sorted by Score in descending order:

In [3]:
df.sort_values('Score',ascending=False)

      Name  Subject  Score Grade
8      Ian  English     96     A
5    Frank  English     90     A
2  Charlie  English     88     B
9     Jack     Math     72     C
3    David     Math     68     D
6    Grace     Math     65     D
1      Bob  Science     61     D
7    Helen  Science     57     F
0    Alice     Math     54     F
4      Eva  Science     53     F

(c) Calculate and print the average score for each subject:

In [4]:
df.groupby('Subject')['Score'].mean()

Subject
English    91.333333
Math       64.750000
Science    57.000000
Name: Score, dtype: float64

(d) Write a Python function pandas_filter_pass(dataframe) that takes a DataFrame
and returns a new DataFrame containing only the records with grades A or B

In [5]:
def pandas_filter_pass(dataframe):
    return dataframe[dataframe['Grade'].isin(['A', 'B'])]

In [6]:
pandas_filter_pass(df)

      Name  Subject  Score Grade
2  Charlie  English     88     B
5    Frank  English     90     A
8      Ian  English     96     A